Revit 2026 API

# RebarShapeConstraintChordLength Class

---

A constraint that can be applied to a RebarShapeDefinitionByArc and drives the straight distance between the arc endpoints.

SystemObject Autodesk.Revit.DB.StructureRebarShapeConstraint Autodesk.Revit.DB.StructureRebarShapeConstraintChordLength

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarShapeConstraintChordLength : RebarShapeConstraint
```
```vb
Public Class RebarShapeConstraintChordLength
	Inherits RebarShapeConstraint
```
```cpp
public ref class RebarShapeConstraintChordLength : public RebarShapeConstraint
```
```fsharp
type RebarShapeConstraintChordLength =
    class
        inherit RebarShapeConstraint
    end
```

The RebarShapeConstraintChordLength type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RebarShapeConstraintChordLength | Create a constraint to drive chord length. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RebarShapeConstraint) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RebarShapeConstraint) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetParamId | Return the Id of the parameter associated with this constraint. (Inherited from RebarShapeConstraint) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Structure Namespace